nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/cmsis_driver_examples/lpi2c/edma_b2b_transfer/slave/pin_mux.c
    const port_pin_config_t LPI2C0_SCL = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          kPORT_NormalDriveStrength,
                                          /* Pin is disabled */
                                          kPORT_MuxAlt0,
                                          /* Digital input disabled; it is required for analog functions */
                                          kPORT_InputBufferDisable,
                                          /* Digital input is not inverted */
                                          kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORT3_12 (pin P15) is disabled */
    PORT_SetPinConfig(LPI2C0_DEINITPINS_LPI2C0_SCL_PORT, LPI2C0_DEINITPINS_LPI2C0_SCL_PIN, &LPI2C0_SCL);

    const port_pin_config_t LPI2C0_SDA = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          kPORT_NormalDriveStrength,
                                          /* Pin is disabled */
                                          kPORT_MuxAlt0,
                                          /* Digital input disabled; it is required for analog functions */
                                          kPORT_InputBufferDisable,
                                          /* Digital input is not inverted */
                                          kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORT3_13 (pin P16) is disabled */
    PORT_SetPinConfig(LPI2C0_DEINITPINS_LPI2C0_SDA_PORT, LPI2C0_DEINITPINS_LPI2C0_SDA_PIN, &LPI2C0_SDA);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
